# -*- coding: utf-8 -*-
"""
# -----------------------------------------------------------------------------------------------------------------------
# ProjectName:  smartIssueTickets
# FileName:     airlines.py
# Description:  TODO
# Author:       ckf10000
# CreateDate:   2024/04/01 17:20:26
# Copyright ©2011-2024. Hunan xyz Company limited. All rights reserved.
# -----------------------------------------------------------------------------------------------------------------------
"""
from decimal import Decimal

airline_map = {
    "3U": "四川航空",
    "8L": "海航旗下祥鹏航空",
    "9C": "春秋航空",
    "9H": "海航旗下长安航空",
    "A6": "湖南航空",
    "AQ": "九元航空",
    "BK": "奥凯航空",
    "CA": "中国国航",
    "CN": "大新华航空",
    "CZ": "南方航空",
    "EU": "成都航空",
    "FM": "上海航空",
    "FU": "航海旗下福航",
    "G5": "华夏航空",
    "GJ": "长龙航空",
    "GS": "海航旗下天津航",
    "GX": "海航旗下北部湾航",
    "GY": "多彩航空",
    "HO": "吉祥航空",
    "HU": "海南航空",
    "JD": "海航旗下首都航",
    "JR": "幸福航空",
    "KN": "中国联合航空",
    "KY": "昆明航空",
    "LT": "龙江航空",
    "MF": "厦门航空",
    "MU": "东方航空",
    "NS": "河北航空",
    "PN": "海航旗下西部航",
    "QW": "青岛航空",
    "RY": "江西航空",
    "SC": "山东航空",
    "TV": "西藏航空",
    "UQ": "海航旗下乌航",
    "Y8": "海航旗下金鹏航空",
    "ZH": "深圳航空",
}

ticket_fee = {
    "fuel_fee": Decimal("70.00"),  # 燃油费
    "airport_fee": Decimal("50.00") # 机建费
}
